Revit 2024 API
ParameterDownloadOptions.GetGroupTypeId Method
 Get properties palette group identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ForgeTypeId GetGroupTypeId()
Visual Basic
Public Function GetGroupTypeId As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetGroupTypeId()
See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace